<h2>PANDAS<h2>

In [1]:
import pandas as pd

In [2]:
pd.Series([])

Series([], dtype: object)

In [3]:
pd.Series([4,2,4,5,7,4,3,2])

0    4
1    2
2    4
3    5
4    7
5    4
6    3
7    2
dtype: int64

In [4]:
pd.Series ([[3,4,5,6],[8,3,4,5]])

0    [3, 4, 5, 6]
1    [8, 3, 4, 5]
dtype: object

In [5]:
score={"Name":("sodiq","harrisson","ayo","sege"),"Testscore":(21,23,45,67),"Examscore":(65,32,45,69)}

In [6]:
score

{'Name': ('sodiq', 'harrisson', 'ayo', 'sege'),
 'Testscore': (21, 23, 45, 67),
 'Examscore': (65, 32, 45, 69)}

In [7]:
pd.DataFrame(score)

        Name  Testscore  Examscore
0      sodiq         21         65
1  harrisson         23         32
2        ayo         45         45
3       sege         67         69

In [8]:
pd.DataFrame(score,index=("Maths","English","Chemistry","Physcis"))

                Name  Testscore  Examscore
Maths          sodiq         21         65
English    harrisson         23         32
Chemistry        ayo         45         45
Physcis         sege         67         69

In [9]:
data=pd.DataFrame(score,index=("Maths","English","Chemistry","Physcis"))

In [10]:
data

                Name  Testscore  Examscore
Maths          sodiq         21         65
English    harrisson         23         32
Chemistry        ayo         45         45
Physcis         sege         67         69

In [11]:
data.Name

Maths            sodiq
English      harrisson
Chemistry          ayo
Physcis           sege
Name: Name, dtype: object

In [12]:
data["Name"]

Maths            sodiq
English      harrisson
Chemistry          ayo
Physcis           sege
Name: Name, dtype: object

In [13]:
data["Testscore"]

Maths        21
English      23
Chemistry    45
Physcis      67
Name: Testscore, dtype: int64

In [14]:
data["Total_score"]=data["Testscore"]+data["Examscore"]

In [15]:
data

                Name  Testscore  Examscore  Total_score
Maths          sodiq         21         65           86
English    harrisson         23         32           55
Chemistry        ayo         45         45           90
Physcis         sege         67         69          136

<h2>DataFrame Filtering<h2>

In [16]:
data.iloc[0,:]

Name           sodiq
Testscore         21
Examscore         65
Total_score       86
Name: Maths, dtype: object

In [17]:
data.loc[:,["Name","Testscore","Examscore"]]

                Name  Testscore  Examscore
Maths          sodiq         21         65
English    harrisson         23         32
Chemistry        ayo         45         45
Physcis         sege         67         69

In [18]:
data.iloc[:2,:]

              Name  Testscore  Examscore  Total_score
Maths        sodiq         21         65           86
English  harrisson         23         32           55

In [19]:
data.iloc[[1,3]]

              Name  Testscore  Examscore  Total_score
English  harrisson         23         32           55
Physcis       sege         67         69          136

In [20]:
data.iloc[0:2,:]

              Name  Testscore  Examscore  Total_score
Maths        sodiq         21         65           86
English  harrisson         23         32           55

In [21]:
data["Examscore"]>32

Maths         True
English      False
Chemistry     True
Physcis       True
Name: Examscore, dtype: bool

In [22]:
data[data["Examscore"]>32]

            Name  Testscore  Examscore  Total_score
Maths      sodiq         21         65           86
Chemistry    ayo         45         45           90
Physcis     sege         67         69          136

<h2>Multipy Filtering<h2></h2>

In [23]:
data[(data["Examscore"]>32) & (data["Testscore"]>30)]

           Name  Testscore  Examscore  Total_score
Chemistry   ayo         45         45           90
Physcis    sege         67         69          136

In [24]:
data[(data["Examscore"]>32) | (data["Testscore"]>30)]

            Name  Testscore  Examscore  Total_score
Maths      sodiq         21         65           86
Chemistry    ayo         45         45           90
Physcis     sege         67         69          136

In [25]:
d=pd.DataFrame(score)

In [26]:
d

        Name  Testscore  Examscore
0      sodiq         21         65
1  harrisson         23         32
2        ayo         45         45
3       sege         67         69

In [27]:
d.describe().T

           count   mean        std   min    25%   50%   75%   max
Testscore    4.0  39.00  21.602469  21.0  22.50  34.0  50.5  67.0
Examscore    4.0  52.75  17.366155  32.0  41.75  55.0  66.0  69.0

In [28]:
score={"Name":("sodiq","harrisson","ayo","sege","joy","uche"),"Testscore":(None,23,45,32,None,12),"Examscore":(65,None,45,69,23,None)}

In [29]:
score

{'Name': ('sodiq', 'harrisson', 'ayo', 'sege', 'joy', 'uche'),
 'Testscore': (None, 23, 45, 32, None, 12),
 'Examscore': (65, None, 45, 69, 23, None)}

In [30]:
pd.DataFrame(score)

        Name  Testscore  Examscore
0      sodiq        NaN       65.0
1  harrisson       23.0        NaN
2        ayo       45.0       45.0
3       sege       32.0       69.0
4        joy        NaN       23.0
5       uche       12.0        NaN

In [31]:
d=pd.DataFrame(score)

In [32]:
d.describe()

       Testscore  Examscore
count    4.00000   4.000000
mean    28.00000  50.500000
std     13.97617  21.126603
min     12.00000  23.000000
25%     20.25000  39.500000
50%     27.50000  55.000000
75%     35.25000  66.000000
max     45.00000  69.000000

In [33]:
d.describe().T

           count  mean        std   min    25%   50%    75%   max
Testscore    4.0  28.0  13.976170  12.0  20.25  27.5  35.25  45.0
Examscore    4.0  50.5  21.126603  23.0  39.50  55.0  66.00  69.0

In [34]:
d.head()

        Name  Testscore  Examscore
0      sodiq        NaN       65.0
1  harrisson       23.0        NaN
2        ayo       45.0       45.0
3       sege       32.0       69.0
4        joy        NaN       23.0

In [35]:
d.head(2)

        Name  Testscore  Examscore
0      sodiq        NaN       65.0
1  harrisson       23.0        NaN

In [36]:
d.tail()

        Name  Testscore  Examscore
1  harrisson       23.0        NaN
2        ayo       45.0       45.0
3       sege       32.0       69.0
4        joy        NaN       23.0
5       uche       12.0        NaN

In [37]:
d.tail(2)

   Name  Testscore  Examscore
4   joy        NaN       23.0
5  uche       12.0        NaN

In [38]:
d.sample(n=2)

        Name  Testscore  Examscore
2        ayo       45.0       45.0
1  harrisson       23.0        NaN

In [39]:
d.sample(n=2)

   Name  Testscore  Examscore
5  uche       12.0        NaN
4   joy        NaN       23.0

In [40]:
d.isna()

    Name  Testscore  Examscore
0  False       True      False
1  False      False       True
2  False      False      False
3  False      False      False
4  False       True      False
5  False      False       True

In [41]:
d.isna().sum()

Name         0
Testscore    2
Examscore    2
dtype: int64

In [42]:
d.isnull()

    Name  Testscore  Examscore
0  False       True      False
1  False      False       True
2  False      False      False
3  False      False      False
4  False       True      False
5  False      False       True

In [43]:
d.isnull().sum()

Name         0
Testscore    2
Examscore    2
dtype: int64

In [44]:
d.describe()

       Testscore  Examscore
count    4.00000   4.000000
mean    28.00000  50.500000
std     13.97617  21.126603
min     12.00000  23.000000
25%     20.25000  39.500000
50%     27.50000  55.000000
75%     35.25000  66.000000
max     45.00000  69.000000

In [45]:
d.fillna(13)

        Name  Testscore  Examscore
0      sodiq       13.0       65.0
1  harrisson       23.0       13.0
2        ayo       45.0       45.0
3       sege       32.0       69.0
4        joy       13.0       23.0
5       uche       12.0       13.0

In [46]:
d.fillna(d["Testscore"].mean(),inplace=True)

In [47]:
d

        Name  Testscore  Examscore
0      sodiq       28.0       65.0
1  harrisson       23.0       28.0
2        ayo       45.0       45.0
3       sege       32.0       69.0
4        joy       28.0       23.0
5       uche       12.0       28.0